In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv")

In [3]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB

In [5]:
df['Age'].mean()

29.471443066516347

In [6]:
df['Age'].max()

80.0

In [7]:
df['Fare'].max()

512.3292

In [8]:
df['Age'].idxmax()

627

In [10]:
df['Age'].idxmin()

799

In [11]:
df['Age'].cumsum()

0         22.00
1         60.00
2         86.00
3        121.00
4        156.00
         ...
882    26057.17
883    26076.17
884    26083.17
885    26109.17
886    26141.17
Name: Age, Length: 887, dtype: float64

In [12]:
df[['Age','Fare']].median()

Age     28.0000
Fare    14.4542
dtype: float64

In [13]:
df[['Age','Fare']].describe()

              Age       Fare
count  887.000000  887.00000
mean    29.471443   32.30542
std     14.121908   49.78204
min      0.420000    0.00000
25%     20.250000    7.92500
50%     28.000000   14.45420
75%     38.000000   31.13750
max     80.000000  512.32920

In [14]:
df.describe()

,Survived,Pclass,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
count,887.000000,887.000000,887.000000,887.000000,887.000000,887.00000
mean,0.385569,2.305524,29.471443,0.525366,0.383315,32.30542
std,0.487004,0.836662,14.121908,1.104669,0.807466,49.78204
min,0.000000,1.000000,0.420000,0.000000,0.000000,0.00000
25%,0.000000,2.000000,20.250000,0.000000,0.000000,7.92500
50%,0.000000,3.000000,28.000000,0.000000,0.000000,14.45420
75%,1.000000,3.000000,38.000000,1.000000,0.000000,31.13750
max,1.000000,3.000000,80.000000,8.000000,6.000000,512.32920

In [15]:
df['Pclass'].value_counts()

3    487
1    216
2    184
Name: Pclass, dtype: int64

In [16]:
df['Pclass'].nunique()

3

In [17]:
df['Pclass'].unique()

array([3, 1, 2], dtype=int64)

In [18]:
df['Age'].drop_duplicates()

0      22.00
1      38.00
2      26.00
3      35.00
5      27.00
       ...
751     0.67
763    30.50
799     0.42
839    34.50
847    74.00
Name: Age, Length: 89, dtype: float64

In [22]:
val = df['Fare'].mean()
df['fare_rate'] = df['Fare'].apply(lambda x:x-val)

In [28]:
df.shift(2,fill_value="sample")

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,fare_rate
0,sample,sample,sample,sample,sample,sample,sample,sample,sample
1,sample,sample,sample,sample,sample,sample,sample,sample,sample
2,0,3,Mr. Owen Harris Braund,male,22,1,0,7.25,-25.0554
3,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38,1,0,71.2833,38.9779
4,1,3,Miss. Laina Heikkinen,female,26,0,0,7.925,-24.3804
...,...,...,...,...,...,...,...,...,...
882,0,3,Mr. Henry Jr Sutehall,male,25,0,0,7.05,-25.2554
883,0,3,Mrs. William (Margaret Norton) Rice,female,39,0,5,29.125,-3.18042
884,0,2,Rev. Juozas Montvila,male,27,0,0,13,-19.3054
885,1,1,Miss. Margaret Edith Graham,female,19,0,0,30,-2.30542
886,0,3,Miss. Catherine Helen Johnston,female,7,1,2,23.45,-8.85542

In [30]:
df.shift(-1,fill_value="sample")

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,fare_rate
0,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38,1,0,71.2833,38.9779
1,1,3,Miss. Laina Heikkinen,female,26,0,0,7.925,-24.3804
2,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35,1,0,53.1,20.7946
3,0,3,Mr. William Henry Allen,male,35,0,0,8.05,-24.2554
4,0,3,Mr. James Moran,male,27,0,0,8.4583,-23.8471
...,...,...,...,...,...,...,...,...,...
882,1,1,Miss. Margaret Edith Graham,female,19,0,0,30,-2.30542
883,0,3,Miss. Catherine Helen Johnston,female,7,1,2,23.45,-8.85542
884,1,1,Mr. Karl Howell Behr,male,26,0,0,30,-2.30542
885,0,3,Mr. Patrick Dooley,male,32,0,0,7.75,-24.5554
886,sample,sample,sample,sample,sample,sample,sample,sample,sample